tutorials/jets/CNRS_jet/1_flow/system/topoSetDictRegion1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    refineCells;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            p1 (0.0 0.0 -1.0e-3);
            p2 (0.0 0.0 1.0e-3);
            radius 1.0e-3;
            /* box (-1.0e-3 -3.5e-3 -1.0) (10.0e-3 2.5e-3 1.0); */
        }
    }

);

// ************************************************************************* //
